app/controllers/photos_controller.rb

   def create
    params[:photo][:category_id] = params[:category_id]
    params[:photo][:user_id] = current_user.id
    @photo = Photo.create(photo_params)
---
INSERT INTO "photos" ("user_id", "category_id", "name", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 13], ["category_id", 1], ["name", "d"], ["created_at", "2017-11-27 20:47:45.612945"], ["updated_at", "2017-11-27 20:47:45.612945"], ["photo", "avar.png"]]