app/controllers/posts_controller.rb

SELECT "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ?  [["post_id", 18]]
---
  def show
   @comments = Postcomment.where(post_id: @post.id)

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["title", "First post"], ["body", "My second post"], ["created_at", "2017-10-20 08:23:59.919079"], ["updated_at", "2017-10-20 08:23:59.919079"]]
---
  def create
  @post = current_user.posts.build(post_params)
  if @post.save